music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
    @band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @bands = Band.all
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "album_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "jazz album"], ["year", 1951], ["album_type", "live"], ["created_at", "2019-03-08 23:32:59.581264"], ["updated_at", "2019-03-08 23:32:59.581264"]]