music_app/app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def new
	@albums = Album.all
	@album = Album.find(params[:album_id])

INSERT INTO "tracks" ("title", "album_id", "ord", "lyrics", "created_at", "updated_at", "track_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "opera song"], ["album_id", 2], ["ord", 1], ["lyrics", "aria"], ["created_at", "2019-03-09 00:07:12.266450"], ["updated_at", "2019-03-09 00:07:12.266450"], ["track_type", "regular"]]
---
def create
	@albums = Album.all
	@track = Track.new(track_params)
	if @track.save

SELECT "albums".* FROM "albums"
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
def edit
	@albums = Album.all
	@track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["title", "opera songggg"], ["updated_at", "2019-03-09 00:13:35.207972"], ["id", 3]]
---
def update
	@track = Track.find(params[:id])
	if @track.update_attributes(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 3]]
---
def destroy
	@track = Track.find(params[:id])
	@album = @track.album
	@track.destroy